tutorials/compressible/DBNS/explicitDBNSSolver/NACA0012_M075_a4/0/T
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          T;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 1 0 0 0];

internalField   uniform 260;

boundaryField
{
    inlet-outlet
    {
        type            fixedValue;
        value           uniform 260;
    }

    body            
    {
        type            slip;
    }

    defaultFaces    
    {
        type            empty;
    }
}


// ************************************************************************* //
