tutorials/compressible/DBNS/explicitDBNSSolver/NACA0012_M075_a4/system/decomposeParDict
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


numberOfSubdomains 8;

method          scotch;

simpleCoeffs
{
    n               (4 2 1);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (4 2 1);
    delta           0.001;
    order           xyz;
}

metisCoeffs
{
    processorWeights 
    ( 1 1 1 1 1 1 1 1 );
}

scotchCoefficients
{
    processorWeights 
    ( 1 1 1 1 1 1 1 1 );
}

manualCoeffs
{
    dataFile        "";
}

distributed     no;

roots           
(
);


// ************************************************************************* //
