tutorials/compressible/DBNS/explicitDBNSSolver/NACA0012_M075_a4/system/fvSchemes
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss skewCorrected linear;
}

divSchemes
{
    default         Gauss skewCorrected linear;
}

laplacianSchemes
{
    default         Gauss skewCorrected linear corrected;
}

interpolationSchemes
{
    default         skewCorrected linear;
}

snGradSchemes
{
    default         skewCorrected corrected;
}

fluxRequired
{
    default           no;
    p;
}

Flux    roeFlux;
Limiter BJLimiter;


// ************************************************************************* //
